{
  "films": [
    {
      "actors": "Daniel Radcliffe · Rupert Grint · Emma Watson",
      "age": "12+",
      "amount": 42,
      "description": "The Harry Potter 8th Collection continues J.K. Rowling's beloved wizarding world with captivating adventures set after the original series. Harry Potter and his friends face new challenges, blending magic, friendship, and a dark mystery that disrupts their peaceful existence. Exploring adulthood's complexities while maintaining the enchanting spirit of the earlier books, this collection offers familiar characters, spellbinding moments, and unexpected twists, providing fans with another thrilling journey into the magical realm of Harry Potter.",
      "duration": "1 h. 52 min.",
      "genre": "Fantasy",
      "id": 1,
      "image": "https://i.ibb.co/6th861H/harrypotter.jpg",
      "imagePoster": "https://i.ibb.co/gVDHzP1/harrypotter-poster.jpg",
      "imageTitle": "https://i.ibb.co/Ky68D6w/harrypotter-title.png",
      "price": 19.99,
      "shortDescription": "The Harry Potter 8th Collection continues the enchanting saga, with Harry and his friends facing new challenges, mysteries, and the complexities of adulthood in the wizarding world.",
      "tags": ["fantasy", "adventure", "film"],
      "title": "Harry Potter 8th Part",
      "year": "2016"
    },
    {
      "actors": " Tom Holland · Zendaya · Benedict Cumberbatch",
      "age": "12+",
      "amount": 42,
      "description": "'Spider-Man: No Way Home' is an exhilarating and action-packed superhero film exploring multiple dimensions. Peter Parker faces powerful enemies from different timelines and the consequences of his secret identity being exposed. With heart-pounding battles, emotional moments, and surprising twists, this highly anticipated installment delivers an epic cinematic experience that will leave audiences on the edge of their seats.",
      "duration": "2 h. 2 min.",
      "genre": "Action, Adventure",
      "id": 2,
      "image": "https://i.ibb.co/hWYdxkV/spiderman.jpg",
      "imagePoster": "https://i.ibb.co/2NhfrwX/spiderman-poster.jpg",
      "imageTitle": "https://i.ibb.co/vQvsTyp/spiderman-title.png",
      "price": 9.99,
      "shortDescription": "'Spider-Man: No Way Home' is a mind-bending adventure as Peter Parker battles enemies across dimensions and faces the consequences of his secret identity being exposed. Packed with action, emotion, and surprising twists, it's a must-see superhero spectacle.",
      "tags": ["action", "adventure", "film"],
      "title": "Spiderman: No way home",
      "year": "2020"
    },
    {
      "actors": " Panda · Tiger · Monkey",
      "age": "3+",
      "amount": 42,
      "description": "This movie follows the story of Po, a Panda who works in his father's noodle shop, but dreams of becoming a Kung Fu champion. When Po learns that the village is hosting a tournament to nominate a Dragon Warrior, he makes his way to the Jade Palace to watch the festivities",
      "duration": "1 h. 32 min.",
      "genre": "Animated Martial Arts Adventure",
      "id": 3,
      "image": "https://i.ibb.co/gMTLr4z/panda.jpg",
      "imagePoster": "https://i.ibb.co/2FW7cCC/panda-poster.jpg",
      "imageTitle": "https://i.ibb.co/Nm0gTt9/panda-title.png",
      "price": 8.99,
      "shortDescription": "JavaScript is the little scripting language that could. Once used chiefly to add interactivity to web browser windows, JavaScript is now a primary building block of powerful and robust applications.",
      "tags": ["animated martial arts adventure", "movie"],
      "title": "Kung Fu Panda",
      "year": "2016"
    },
    {
      "actors": " Vin Diesel · Michelle Rodriguez · John Cena",
      "age": "16+",
      "amount": 42,
      "description": "Fast & Furious 9 takes the adrenaline-fueled franchise to new heights with action-packed heists, car chases, and jaw-dropping stunts. Dom Toretto and his crew face their most dangerous enemy yet in this thrilling ride. With heart-pounding action, unexpected twists, and beloved characters returning, fans will experience non-stop excitement. Buckle up for a wild ride where family, loyalty, and fast cars collide in spectacular fashion.",
      "duration": "1 h. 22 min.",
      "genre": "Action Thriller",
      "id": 4,
      "image": "https://i.ibb.co/PDqyQKP/fast-NFurious9.jpg",
      "imagePoster": "https://i.ibb.co/2kdBDJJ/fast-NFurious9-poster.jpg",
      "imageTitle": "https://i.ibb.co/hgB1QhD/fast-NFurious9-title.png",
      "price": 8.99,
      "shortDescription": "Fast & Furious 9—an adrenaline-fueled action sequel featuring high-stakes heists, intense car chases, and a beloved character reunion. ",
      "tags": ["action", "film"],
      "title": "Fast & Furious 9",
      "year": "2019"
    }
  ]
}
