{
  "films": [
    {
      "id": 1,
      "price": 19.99,
      "image": "./generalImages/harrypotter.jpg",
      "imagePoster": "./generalImages/harrypotter_poster.jpg",
      "imageTitle": "./generalImages/harrypotter_title.jpg",
      "title": "Harry Potter 8th Part",
      "genre": "Fantasy",
      "tags": ["fantasy", "adventure", "film"],
      "amount": 42,
      "shortDescription": "The Harry Potter 8th Collection continues the enchanting saga, with Harry and his friends facing new challenges, mysteries, and the complexities of adulthood in the wizarding world.",
      "description": "The Harry Potter 8th Collection is a captivating continuation of J.K. Rowling's beloved wizarding world. Set several years after the events of the original series, it follows Harry Potter and his friends as they face new challenges and adventures. With a blend of magic, friendship, and a dark mystery that threatens their peaceful existence, the 8th Collection explores the complexities of adulthood while staying true to the enchanting spirit of the earlier books. Packed with familiar characters, spellbinding moments, and unexpected twists, this collection offers fans another thrilling journey into the magical realm of Harry Potter.",
      "year": "2016",
      "age": "12+",
      "duration": "1 h. 52 min.",
      "actors": "Daniel Radcliffe · Rupert Grint · Emma Watson"
    },
    {
      "id": 2,
      "price": 9.99,
      "image": "./generalImages/spiderman.jpg",
      "imagePoster": "./generalImages/spiderman_poster.jpg",
      "imageTitle": "./generalImages/spiderman_title.png",
      "title": "Spiderman: No way home",
      "genre": "Action, Adventure",
      "tags": ["action", "adventure", "film"],
      "amount": 42,
      "shortDescription": "'Spider-Man: No Way Home' is a mind-bending adventure as Peter Parker battles enemies across dimensions and faces the consequences of his secret identity being exposed. Packed with action, emotion, and surprising twists, it's a must-see superhero spectacle.",
      "description": "'Spider-Man: No Way Home' is an exhilarating and action-packed superhero film that takes audiences on a thrilling journey through multiple dimensions. As Peter Parker's world is turned upside down, he must confront powerful enemies from different timelines and face the consequences of his secret identity being exposed. Packed with heart-pounding battles, emotional moments, and surprising twists, this highly anticipated installment in the Spider-Man franchise delivers an epic cinematic experience that will leave audiences on the edge of their seats.",
      "year": "2020",
      "age": "12+",
      "duration": "2 h. 2 min.",
      "actors": " Tom Holland · Zendaya · Benedict Cumberbatch"
    },

    {
      "id": 3,
      "price": 8.99,
      "image": "./generalImages/panda.jpg",
      "imagePoster": "./generalImages/panda_poster.jpg",
      "imageTitle": "./generalImages/panda_title.png",
      "title": "Kung Fu Panda",
      "genre": "Animated Martial Arts Adventure",
      "tags": ["animated martial arts adventure", "movie"],
      "amount": 42,
      "shortDescription": "JavaScript is the little scripting language that could. Once used chiefly to add interactivity to web browser windows, JavaScript is now a primary building block of powerful and robust applications.",
      "description": "This movie follows the story of Po, a Panda who works in his father's noodle shop, but dreams of becoming a Kung Fu champion. When Po learns that the village is hosting a tournament to nominate a Dragon Warrior, he makes his way to the Jade Palace to watch the festivities",
      "year": "2016",
      "age": "3+",
      "duration": "1 h. 32 min.",
      "actors": " Panda · Tiger · Monkey"
    },
    {
      "id": 4,
      "price": 8.99,
      "image": "./generalImages/fastNFurious9.jpg",
      "imagePoster": "./generalImages/fastNFurious9_poster.jpg",
      "imageTitle": "./generalImages/fastNFurious9_title.jpg",
      "title": "Fast & Furious 9",
      "genre": "Action Thriller",
      "tags": ["action", "film"],
      "amount": 42,
      "shortDescription": "Fast & Furious 9—an adrenaline-fueled action sequel featuring high-stakes heists, intense car chases, and a beloved character reunion. ",
      "description": "Fast & Furious 9 is an action-packed thrill ride that takes the adrenaline-fueled franchise to new heights. As Dom Toretto and his crew face their most dangerous enemy yet, they must navigate a world of high-stakes heists, intense car chases, and jaw-dropping stunts. With heart-pounding action sequences, unexpected twists, and a reunion of beloved characters, Fast & Furious 9 delivers non-stop excitement for fans of the franchise. Buckle up for a wild ride where family, loyalty, and fast cars collide in spectacular fashion.",
      "year": "2019",
      "age": "16+",
      "duration": "1 h. 22 min.",
      "actors": " Vin Diesel · Michelle Rodriguez · John Cena"
    }
  ]
}
